000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ПротоколСервисов/ПротоколСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПротоколСервисов</name>
  <comment>Данные для борьбы с DoS атаками</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КлючевоеЗначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяПроцедуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ОсновнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ВидЦенИнтернет</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольОстатковПриОтменеПроведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РучнаяСкидкаНаПодарочныйСертификат</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальныйПроцентРучнойСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерТестовогоМагазина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПереходаНаЛетнееВремя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПереходаНаЗимнееВремя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрольОписанияПричиныРучнойСкидки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </resources>
  <resources>
    <name>СкладЦентральныйИнтернетМагазина</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>ПрограммаЛояльности</name>
    <type>
      <types>EnumRef.ВидыПрограммЛояльности</types>
    </type>
  </resources>
  <resources>
    <name>ПродажиДляCRMпослеЗакрытияСмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УслугаДоставкиЗаказаПокупателя</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>СуммаОплатыЧастямиДляЦенника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НазваниеХарактеристикиДляПересчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеХарактеристикиДляПересчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопытокУдаления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БлокироватьОперацииПриОтсутствииСоединенияЦБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьПереносДокументаВДругойПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьNavisionПоступлениеПереброски</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальнаяСуммаНакопленияЛояльности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроверятьПеремещенияПоЗаказамВЦентре</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьТолькоТорговыйЗал</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьОбменССайтомНаПериферийныхУзлах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьБонуснуюСистему</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеНачислятьБаллыПриОплатеБонусами</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьУкраинскоеНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазмерПакетаВиртуальныхКартРезерва</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыполнятьСверкуИнформативныхОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЧекиКакРегистраторыНачисленияБонусныхБаллов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДвиженияБонусныхБалловТолькоВЦентре</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЦенаПродажиМинимальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПечататьВЧекеДанныеБонусногоСчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьПрямуюИнтеграциюMagento</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьОплатуБонусамиПоЗаказуПокупателяНаРМК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьОплатуБонуснымиБалламиПодарочныхСертификатов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>TimeoutDDos</name>
    <comment>Минимальный интервал между запросами из внешних систем</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВсеПродажиБезНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяУчетаКассовогоДня</name>
    <comment>Минимальное время, когда можно учесть КД для NAV</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПротоколФормРМК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПротоколВерсииОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ГлубинаОповещенияОбАннуляцииБонусныхБаллов</name>
    <comment>Глубина в днях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыполнятьЗагрузкуОбменаПередОбновлением</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ПротоколСервисов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Разрешено(Знач Идентификатор, ИмяПроцедуры, КлючевоеЗначение)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	РезультатЗащиты		= СоставРезультата();
	МинимальныйИнтервал	= ПолучитьМинимальныйИнтервал();

	Если ПустаяСтрока(Идентификатор) Тогда

		Идентификатор = ?(ЗначениеЗаполнено(КлючевоеЗначение), СокрЛП(КлючевоеЗначение), "<не указан>");

	КонецЕсли;

	Если НЕ МинимальныйИнтервал = 0 Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаПротокол.Период КАК Период
		|ИЗ
		|	РегистрСведений.ПротоколСервисов.СрезПоследних КАК ТаблицаПротокол
		|ГДЕ
		|	ТаблицаПротокол.Идентификатор = &Идентификатор
		|	И ТаблицаПротокол.ИмяПроцедуры = &ИмяПроцедуры"
		);
		Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
		Запрос.УстановитьПараметр("ИмяПроцедуры" , ИмяПроцедуры);

		РезультатЗапроса = Запрос.Выполнить();

		ТекущийПериод = ТекущаяДата();

		Если НЕ РезультатЗапроса.Пустой() Тогда	//	было подобное обращение!

			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();

			Если НачалоДня(Выборка.Период) = НачалоДня(ТекущийПериод) Тогда

				РезультатЗащиты.Секунды = ТекущийПериод - Выборка.Период;

				Если РезультатЗащиты.Секунды < МинимальныйИнтервал Тогда

					РезультатЗащиты.Принять	= Ложь;

				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

		НаборЗаписей = РегистрыСведений.ПротоколСервисов.СоздатьНаборЗаписей();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;

		НаборЗаписей.Отбор.Период.Установить(ТекущийПериод);
		НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);
		НаборЗаписей.Отбор.ИмяПроцедуры.Установить(ИмяПроцедуры);

		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Период			= НаборЗаписей.Отбор.Период.Значение;
		ЗаписьНабора.Идентификатор	= НаборЗаписей.Отбор.Идентификатор.Значение;
		ЗаписьНабора.ИмяПроцедуры	= НаборЗаписей.Отбор.ИмяПроцедуры.Значение;
		ЗаписьНабора.КлючевоеЗначение = КлючевоеЗначение;
		ЗаписьНабора.Примечание		= ?(РезультатЗащиты.Принять, "", "Отказано (" + Формат(РезультатЗащиты.Секунды, "ЧН=0; ЧГ=") + " секунд)");

		НаборЗаписей.Записать();

	КонецЕсли;

	Возврат РезультатЗащиты;

КонецФункции

Функция СоставРезультата()	Экспорт

	Возврат Новый Структура("Принять, Секунды", Истина, -99999);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьМинимальныйИнтервал()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	УчетнаяПолитика.TimeoutDDos КАК TimeoutDDos
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика.СрезПоследних КАК УчетнаяПолитика"
	);

	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();

		МинимальныйИнтервал = Выборка.TimeoutDDos;

	КонецЕсли;

	Возврат МинимальныйИнтервал;

КонецФункции

#КонецОбласти
	
#КонецЕсли
